/*
  mgwfsf: Atari/MidwayGamesWest filesystem using libfuse: Filesystem in Userspace

  Copyright (C) 2025  Dave Shepperd <mgwfsf@dshepperd.com>

  This program can be distributed under the terms of the GNU GPLv2.
  See the file COPYING.

 Compile with:
 gcc -Wall -c -g mgwfsf.c -I/usr/local/include/fuse3
 gcc -Wall -c -g freemap.c
 gcc -g -o mgwfsf mgwfsf.o freemap.o -lfuse3 -lpthread

*/

#define _LARGEFILE64_SOURCE 
#define FUSE_USE_VERSION 31

#include <fuse.h>
#include <stdio.h>
#include <unistd.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <stddef.h>
#include <linux/magic.h>
#include <sys/vfs.h>
//#include <getopt.h>

typedef uint32_t sector_t;
#include "mgwfsf.h"

#ifndef S_IFREG
#define S_IFREG 0100000
#endif
#ifndef S_IFDIR
#define S_IFDIR 0040000
#endif

typedef struct part
{
    uint8_t status;
    uint8_t st_head;
    uint16_t st_sectcyl;
    uint8_t type;
    uint8_t en_head;
    uint16_t en_sectcyl;
    uint32_t abs_sect;
    uint32_t num_sects;
} Partition;

typedef struct
{
    uint8_t jmp[3];          /* 0x000 x86 jump */
    uint8_t oem_name[8];     /* 0x003 OEM name */
    uint8_t bps[2];          /* 0x00B bytes per sector */
    uint8_t sects_clust;     /* 0x00D sectors per cluster */
    uint16_t num_resrv;      /* 0x00E number of reserved sectors */
    uint8_t num_fats;        /* 0x010 number of FATs */
    uint8_t num_roots[2];    /* 0x011 number of root directory entries */
    uint8_t total_sects[2];  /* 0x013 total sectors in volume */
    uint8_t media_desc;      /* 0x015 media descriptor */
    uint16_t sects_fat;      /* 0x016 sectors per FAT */
    uint16_t sects_trk;      /* 0x018 sectors per track */
    uint16_t num_heads;      /* 0x01A number of heads */
    uint32_t num_hidden;     /* 0x01C number of hidden sectors */
    uint32_t total_sects_vol;/* 0x020 total sectors in volume */
    uint8_t drive_num;       /* 0x024 drive number */
    uint8_t reserved0;       /* 0x025 unused */
    uint8_t boot_sig;        /* 0x026 extended boot signature */
    uint8_t vol_id[4];       /* 0x027 volume ID */
    uint8_t vol_label[11];   /* 0x02B volume label */
    uint8_t reserved1[8];    /* 0x036 unused */
    uint8_t bootstrap[384];  /* 0x03E boot code */
    Partition parts[4];      /* 0x1BE partition table */
    uint16_t end_sig;        /* 0x1FE end signature */
} BootSector_t; // __attribute__ ((packed));

static BootSector_t bootSect;
MgwfsSuper_t ourSuper;

/*
 * Command line options
 */
typedef struct
{
	unsigned long filler;		/* Fuse like to clobber this with a 0xffffff for some reason */
	unsigned long allocation;
	unsigned long copies;
	unsigned long verbose;
	unsigned long show_help;
	unsigned long quit;
	const char *image;
	const char *logFile;
	const char *testPath;
} Options_t;

static Options_t options;

static void displayFileHeader(FILE *outp, FsysHeader *fhp, int retrievalsToo)
{
	FsysRetPtr *rp;
	int alt,ii;
	
	fprintf(outp,  "    id:        0x%X\n"
			       "    size:      %d\n"
				   "    clusters:  %d\n"
				   "    generation:%d\n"
				   "    type:      %d\n"
				   "    flags:     0x%04X\n"
				   "    ctime:     %d\n"
				   "    mtime:     %d\n"
			, fhp->id
			, fhp->size
			, fhp->clusters
			, fhp->generation
